In [1]:
import numpy as np
import pandas as pd

In [2]:
#Data Frame, serilerin yan yana gelmesinden oluşturulmuş bir excel tablosu denilebilir.

In [2]:
data = np.random.randn(4,3)
#Hatırlatma: 4 satır 3 sütunlu 0 ortalamalı 1 varyanslı rastgele değişkenler matrisi.

In [3]:
data

array([[-0.40416671, -1.31522392, -0.30232185],
       [ 0.20485068,  0.01664079, -0.45653587],
       [-1.07842095,  1.23628666, -0.34100915],
       [-1.16857222, -0.96187243,  1.10319274]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame #Bir excel tablosu gibi seriler bütünü oluşturdu.

          0         1         2
0 -1.167870  1.266827 -0.757659
1  1.218777 -1.125934 -0.667010
2 -0.971973 -0.510430  0.371497
3 -0.247016  1.021742  0.380814

In [7]:
dataFrame[0] #İlk "sütun" çağrıldı.

0   -1.167870
1    1.218777
2   -0.971973
3   -0.247016
Name: 0, dtype: float64

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [9]:
#Tipinin seri olduğu görülür. Çünkü denildiği üzere Data Frame'ler serilerden oluşmaktadır.

In [4]:
yeniDataFrame = pd.DataFrame(data,index = ["Atil","Zeynep","Atlas","Mehmet"], columns = ["Maas","Yas","Calisma Saati"])
#İstediğimiz indexi ve sütun ismini kendimiz atayabiliriz.
#İndex ve sütün isimleri oluşturulurken Türkçe karakter kullanılmamasına dikkat edilmeli.

In [5]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.404167 -1.315224      -0.302322
Zeynep  0.204851  0.016641      -0.456536
Atlas  -1.078421  1.236287      -0.341009
Mehmet -1.168572 -0.961872       1.103193

In [12]:
yeniDataFrame["Yas"] #Yaş sütunu çağrıldı.

Atil      1.266827
Zeynep   -1.125934
Atlas    -0.510430
Mehmet    1.021742
Name: Yas, dtype: float64

In [13]:
yeniDataFrame["Calisma Saati"]

Atil     -0.757659
Zeynep   -0.667010
Atlas     0.371497
Mehmet    0.380814
Name: Calisma Saati, dtype: float64

In [14]:
yeniDataFrame[["Maas","Yas"]] #Birden fazla sütun ismi yazılarak da tablo çağrılabilir.

            Maas       Yas
Atil   -1.167870  1.266827
Zeynep  1.218777 -1.125934
Atlas  -0.971973 -0.510430
Mehmet -0.247016  1.021742

In [15]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [16]:
yeniDataFrame.loc["Atil"]
#Eğer bir satır çağrılmak istenirse "loc" fonksiyonu(locate) ile beraber "köşeli parantez içinde" satır ismi yazılmalıdır.

Maas            -1.167870
Yas              1.266827
Calisma Saati   -0.757659
Name: Atil, dtype: float64

In [17]:
yeniDataFrame.loc["Zeynep"]

Maas             1.218777
Yas             -1.125934
Calisma Saati   -0.667010
Name: Zeynep, dtype: float64

In [18]:
yeniDataFrame.iloc[1]
#Zeynep, 1. index olarak tutulduğu için index bazlı da satır çağrılabilir.

Maas             1.218777
Yas             -1.125934
Calisma Saati   -0.667010
Name: Zeynep, dtype: float64

In [19]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

### Not: Data Framemimize sonradan yeni sütun da ekleyebiliriz.

In [8]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]
#yeniDataFrame["Emeklilik Yasi"] = [0,1,2,3] --> Kendimiz de veri seti ekleyebiliriz.

In [9]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.404167 -1.315224      -0.302322       -2.630448
Zeynep  0.204851  0.016641      -0.456536        0.033282
Atlas  -1.078421  1.236287      -0.341009        2.472573
Mehmet -1.168572 -0.961872       1.103193       -1.923745

In [22]:
yeniDataFrame.drop("Emeklilik Yasi")

KeyError: "['Emeklilik Yasi'] not found in axis"

In [23]:
#Böyle yazıldığında hata verir. Çünkü şu anda "Emeklilik Yasi"ni satırda aradı. axis = 0 olarak aldı. 
#Sütunu belirtmek için:

In [24]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1) #şeklinde yazılmalı.

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [25]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -1.167870  1.266827      -0.757659        2.533653
Zeynep  1.218777 -1.125934      -0.667010       -2.251869
Atlas  -0.971973 -0.510430       0.371497       -1.020860

In [26]:
#Direkt silindi. Çünkü varsayılan olarak "drop" içerisinde yazılan ifadeyi satırda arıyor (axis = 0 olduğu için).
#Garanti olması için axisi belirtme iyi olacaktır.

In [27]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -1.167870  1.266827      -0.757659        2.533653
Zeynep  1.218777 -1.125934      -0.667010       -2.251869
Atlas  -0.971973 -0.510430       0.371497       -1.020860
Mehmet -0.247016  1.021742       0.380814        2.043483

In [28]:
#Hala aynı. Data Framemimiz değişmemiş. Değiştirmek için:

In [29]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)
#olarak yazılmalıdır. "inplace", oluşturduğumuz Data Framemimizin içinde bunu yap demektir. Boolean değer alır.
#Varsayılan değer False olduğu için silmemişti.

In [30]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [31]:
#Sütunumuz gitti. Sorun çözüldü.

In [32]:
yeniDataFrame.loc["Atil"]["Yas"] #Bu şekilde seri içindeki değeri çağırabiliriz.

1.2668265802612917

In [33]:
yeniDataFrame.loc["Atil"]["Maas"]

-1.1678697898015888

In [34]:
yeniDataFrame.loc["Atlas","Yas"] #Bu şekilde de kullanılabilir.

-0.510430175464554

In [35]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [36]:
yeniDataFrame < 0 #0'dan küçük olanları True, olmayanları False olarak getirdi.

         Maas    Yas  Calisma Saati
Atil     True  False           True
Zeynep  False   True           True
Atlas    True   True          False
Mehmet   True  False          False

In [37]:
booleanFrame = yeniDataFrame < 0

In [38]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil     True  False           True
Zeynep  False   True           True
Atlas    True   True          False
Mehmet   True  False          False

In [39]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [40]:
yeniDataFrame[booleanFrame]
#0'dan küçük olanları gösterip diğerlerini "NaN" olarak gösterdi. (Aslında 0'dan küçük olanları çağır anlamındadır.)

            Maas       Yas  Calisma Saati
Atil   -1.167870       NaN      -0.757659
Zeynep       NaN -1.125934      -0.667010
Atlas  -0.971973 -0.510430            NaN
Mehmet -0.247016       NaN            NaN

In [41]:
yeniDataFrame[yeniDataFrame < 0] #Bu şekilde de yazılabilir.

            Maas       Yas  Calisma Saati
Atil   -1.167870       NaN      -0.757659
Zeynep       NaN -1.125934      -0.667010
Atlas  -0.971973 -0.510430            NaN
Mehmet -0.247016       NaN            NaN

In [42]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] #Yas sütununda 0'dan büyük olanları getirdi.

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Mehmet -0.247016  1.021742       0.380814

In [43]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [44]:
#Yani biz "yeniDataFrame" diyip köşeli parantez içerisinde koşul da yazabiliriz.

In [45]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [46]:
yeniDataFrame.reset_index()
#İndexleri resetler ve "index" adında bizim koyduğumuz isimler yer alan yeni bir sütun oluşturur.

    index      Maas       Yas  Calisma Saati
0    Atil -1.167870  1.266827      -0.757659
1  Zeynep  1.218777 -1.125934      -0.667010
2   Atlas -0.971973 -0.510430       0.371497
3  Mehmet -0.247016  1.021742       0.380814

In [47]:
 #Varsayılan index yerine kendimiz de indexler oluşturabiliriz.

In [48]:
yeniDataFrame 

#Bu arada "inplace" kullanmadığımız için Data Framemimiz değişmedi.

            Maas       Yas  Calisma Saati
Atil   -1.167870  1.266827      -0.757659
Zeynep  1.218777 -1.125934      -0.667010
Atlas  -0.971973 -0.510430       0.371497
Mehmet -0.247016  1.021742       0.380814

In [49]:
yeniIndexListesi = ["Ati", "Zey", "Atl", "Meh"]

#Önce olmasını istediğimiz indexleri listeye ekledik.

In [50]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

#Sonrasında "Yeni Indeks" adında "yeniIndexListesi"ni Data Framemimize yeni bir sütun olarak ekledik.

In [51]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -1.167870  1.266827      -0.757659         Ati
Zeynep  1.218777 -1.125934      -0.667010         Zey
Atlas  -0.971973 -0.510430       0.371497         Atl
Mehmet -0.247016  1.021742       0.380814         Meh

In [52]:
yeniDataFrame.set_index("Yeni Indeks")

#En sonunda "set_index" diyerek o sütunumuzu index olarak ekledik.

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -1.167870  1.266827      -0.757659
Zey          1.218777 -1.125934      -0.667010
Atl         -0.971973 -0.510430       0.371497
Meh         -0.247016  1.021742       0.380814

In [53]:
yeniDataFrame

#Data Framemimiz hala aynı. Bunu düzeltmek için -bilindiği üzere- inplace koymamız gerekiyor.

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -1.167870  1.266827      -0.757659         Ati
Zeynep  1.218777 -1.125934      -0.667010         Zey
Atlas  -0.971973 -0.510430       0.371497         Atl
Mehmet -0.247016  1.021742       0.380814         Meh

In [54]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [55]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -1.167870  1.266827      -0.757659
Zey          1.218777 -1.125934      -0.667010
Atl         -0.971973 -0.510430       0.371497
Meh         -0.247016  1.021742       0.380814

In [56]:
yeniDataFrame.loc["Ati"]

Maas            -1.167870
Yas              1.266827
Calisma Saati   -0.757659
Name: Ati, dtype: float64

In [57]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [58]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [60]:
birlesmisIndeks

#Amacımız 3 tane Simpson ve South Park yazması yerine 1 kere yazdırması. Bunun için "MultiIndex" metodunu kullanacağız.

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [62]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [63]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [64]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [65]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [66]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndeks, columns=["Yas","Meslek"])

In [67]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [68]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [69]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [72]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

#"South Park" indeksteki "Kenny" indeksini getirmek için bu şekilde kullanmamız gerekiyor.

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [73]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [74]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

#İndekslere başlık eklemek için bu komutları kullanmalıyız.

In [75]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F